       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB03.
      ********************************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = Dayane(ALURA) Daya
      *OBJETIVO : NOME E SALARIO
      *IMPRIMIR FORMATADO - USO DA VIRGULA
      *DATA = XX/XX/XXX
      ********************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *V99 INFORMA A CASA DECIMAL ENTÃO ESSE V É DE VIRGULA 99(NUMERO DE CASAS)
      *Z(mascara) SE O VALOR CONTER 00 PRA ESQUERDA ELE OMITE
       77 WRK-NOME PIC X(20) VALUE SPACES.
       77 WRK-SALARIO PIC 9(06)V99 VALUE ZEROS.
       77 WRK-SALARIO-ED PIC $ZZZ.ZZ9,99 VALUE ZEROS.
       PROCEDURE DIVISION.
       ACCEPT WRK-NOME    FROM CONSOLE.
       ACCEPT WRK-SALARIO FROM CONSOLE.
      ********************* MOSTRA DADOS
        DISPLAY 'NOME     'WRK-NOME.
      *MOVE A VARIAVEL PARA TO OUTRA VARIAVEL E MOSTRA FORMATADO.
        MOVE WRK-SALARIO TO WRK-SALARIO-ED.
        DISPLAY 'SALARIO  'WRK-SALARIO-ED.
        STOP RUN.
