       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB03.
      ********************************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = Dayane(ALURA) Daya
      *OBJETIVO : RECEBER E IMPRIMIR DATA DO SISTEMA
      *UTILIZAR VARIAVEIS NIVEL 01.02... (ESTRUTURADA)
      *DATA = XX/XX/XXX
      ********************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *ESSE É O PAI 01 ELE TEM 3 FILHOS ANO,MES E DIA
       01 WRK-DATA.
           02 WRK-ANO PIC 9(04) VALUE ZEROS.
           02 WRK-MES PIC 9(02) VALUE ZEROS.
           02 WRK-DIA PIC 9(02) VALUE ZEROS.
       PROCEDURE DIVISION.
      *DATE (INFORMAÇÃO DO SISTEMA) E CONSOLE (A PESSOA QUE VAI DIGITAR)
       ACCEPT WRK-DATA FROM DATE YYYYMMDD.
        DISPLAY ' DATA ' WRK-DIA ' DE ' WRK-MES ' DE ' WRK-ANO.
        STOP RUN.
