       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTE2.
      ********************************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = Dayane(ALURA) Daya
      *OBJETIVO : MOSTRAR A STRING HELLO ALURA
      *DATA = XX/XX/XXX
      ********************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
        DISPLAY 'Hello Alura'.
        STOP RUN.
